cfd/OpenFOAM/compressible/rhoSimpleFoam/06_tetMesh/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

// ************************************************************************* //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;


boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    model
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
