cfd/OpenFOAM/compressible/rhoSimpleFoam/06_tetMesh/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

// ************************************************************************* //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform $turbulentOmega;


boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
    
    freestream
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    model
    {
        type        omegaWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
